# คือพี่มีหนังสืออยู่แต่พี่เป็นคนอ่านหนังสือไม่เกิน 7 บรรทัด
# เพราะฉะนั้นพี่เลยอยากให้น้องๆช่วยพี่เรียงประโยคจากประโยคที่มีตัวอักษรน้อยที่สุดไปประโยคที่มีตัวอักษรมากที่สุดให้พี่ที
# กรณีมีจำนวนตัวอักษรเท่ากัน ให้นำตัวที่ป้อนข้อมูลเข้ามาก่อนขึ้นก่อน
# ลองศึกษาเพิ่มเติมใน w3school ได้นะคั้บ

# Input Specification
# n บรรทัด
# รับค่าไปเรื่อยๆจนกว่าจะเจอคำว่า END

# Output Specification
# บรรทัด เป็นข้อความที่เรียงตามความยาวแล้ว จากสั้นสุด ไปยาวสุด บรรทัดละ 1 ข้อความ

word_list = []
while True:
    word = input()
    if word.lower() == 'end':
        break
    word_list.append(word)
word_list_sorted = sorted(word_list, key=len)
for i in word_list_sorted:
    print(i)
