# เราจะมาคิดค่าโดยสารของรถไฟฟ้า BTS แบบปัจจุบันกันดีกว่า (อ้างอิงจากเว็บ: https://www.bts.co.th/routemap.html)

# ส่วนสัมปทานเริ่มแรก ตั้งแต่สถานีหมอชิต (N8) ถึงสถานีอ่อนนุช (E9) ของสายสุขุมวิท และ สถานีสนามกีฬาแห่งชาติ (W1) ถึงสะพานตากสิน (S6) ของสายสีลม จำนวน 23 สถานี normal rate
# 17 25 28 32 35 40 43 47
# ส่วนต่อขยายสายสีลม ช่วงตากสิน - เพชรเกษม ระยะที่ 1 จากสถานีสะพานตากสิน (S6) ถึงสถานีวงเวียนใหญ่ (S8) จำนวน 2 สถานี ให้เก็บค่าโดยสารร่วมกับส่วนสัมปทานหลัก
# ส่วนต่อขยายสายสุขุมวิท ระยะที่ 1 ช่วงอ่อนนุช - แบริ่ง (ลาซาล) จากสถานีอ่อนนุช (E9) ถึงสถานีแบริ่ง (E14) จำนวน 5 สถานี ให้เก็บค่าโดยสารแบบเหมาจ่าย 15 บาท กรุงเทพมหานคร
# ส่วนต่อขยายสายสีลม ช่วงตากสิน - เพชรเกษม ระยะที่ 2 จากสถานีวงเวียนใหญ่ (S8) ถึงสถานีบางหว้า (S12) จำนวน 4 สถานี ให้เก็บค่าโดยสารแบบเหมาจ่าย 15 บาท กรุงเทพมหานคร เช่นเดียวกับส่วนต่อขยายสายสุขุมวิท ระยะที่ 1 ช่วงอ่อนนุช - แบริ่ง (ลาซาล)
# ส่วนต่อขยายสายสุขุมวิทใต้ (เขียวใต้) จากสถานีแบริ่ง (E14) ถึงสถานีเคหะฯ (E23) จำนวน 9 สถานี ดูแลโดยกรุงเทพมหานคร ช่วงนี้ฟรีค่าบริการ
# ส่วนต่อขยายสายสุขุมวิทเหนือ (เขียวเหนือ) จากสถานีหมอชิต (N8) ถึงสถานีคูคต (N24) จำนวน 16 สถานี ดูแลโดยกรุงเทพมหานคร ช่วงนี้ฟรีค่าบริการ เช่นเดียวกับส่วนต่อขยายสายสุขุมวิทใต้ (เขียวใต้)

# ข้อสังเกตในการเก็บค่าโดยสาร อ้างอิงจากเว็บไซต์ของรถไฟฟ้า BTS (https://www.bts.co.th/routemap.html)
# ถ้านั่งผ่านส่วนของกรุงเทพมหานคร ให้เก็บค่าโดยสารของส่วนกรุงเทพมหานครแค่ครั้งเดียว กรุงเทพมหานครไม่ได้ใจร้ายกับเราขนาดนั้น
# ถ้านั่งข้ามส่วน เช่น พี่นั่งจากสถานีอโศก (E4) ไปสถานีบางจาก (E10) พี่ก็จะโดนค่าโดยสารทั้งหมด 2 ส่วน คือ ส่วนสัมปทานหลัก และ ส่วนของกรุงเทพมหานคร เช่นเดียวกันกับส่วนอื่นๆ
# N6 "Error"
# https://www.youtube.com/watch?v=xwq45th06Nw