# Description
# เรื่องนี้เกิดขึ้นในเมืองแฟนตาซีใต้น้ำที่ชื่อว่า Bikini Bottom ที่มีร้าน Krusty Krab เป็น ร้าน Fast food ที่มี Mr. Krabs เป็นเจ้าของร้าน มีข้อกำหนดว่า “ลูกค้าแต่ละคนต้องสั่งไม่ต่ำกว่า 1 ชนิด ”โดยทางร้าน Krusty Krab พี่จึงอยากให้น้องๆเขียนโปรแกรมช่วย Squidward ในการส่งเมนูไปให้ Spoudbob เพื่อทำอาหารส่งให้ลูกค้า
# menu

# Input Specification
# หลายบรรทัด รับไปเรื่อยๆจนกว่าจะเจอคำว่า "DONE"
# แต่ละบรรทัดประกอบด้วยชื่ออาหาร และหมายเลขคอส คั่นด้วย " #" หากหมายเลขเมนูเป็น #N ให้ต่อท้ายสุดของเมนูในขณะนั้น หากเป็น จำนวนเต็มบวก ให้แทรกไปในตำแหน่งนั้น (เริ่มนับจาก 1)

# Output Specification
# บรรทัดเดียวคือ เมนูของร้านนี้ทั้งตามลำดับเมนูแรกจนสุดท้าย (ตาม sample case)

# Krabby Patty #2
# Krabby Meal #1
# DONE
# Menu: ['Krabby Meal', 'Krabby Patty']