# รอบที่แล้วพี่ให้จัดหนังสือไปแล้วรอบนี้ช่วยพี่นับหนังสือที!

# โดยพี่จะให้รหัสหนังสือน้องไปตามลำดับจนครบ ให้น้องช่วยเรียงหนังสือตามลำดับตัวอักษร (ยึดจากการเรียงข้อมูลในภาษา python จากน้อยไปมาก)
# แล้วให้น้องๆบอกข้อมูลของหนังสือแต่ละรหัสดังนี้

# ชื่อหนังสือ + ลำดับแรกของหนังสือนั้นที่พี่ให้ในตอนแรก + จำนวนเล่มของหนังสือนั้น

# Input Specification
# n บรรทัด
# รับค่ารหัสหนังสือจนกว่าจะเจอคำว่า END

# Output Specification
# n บรรทัด
# แต่ละบรรทัดจะมี รหัสหนังสือ ลำดับแรกของหนังสือนั้นที่ป้อนไปในตอนแรก จำนวนของหนังสือเล่มนั้น