# หลอดไฟยี่ห้อ ITLadkrabang เมื่อสับสวิตซ์ ถ้าหลอดไฟปิดอยู่จะเปิดไฟสีน้ำเงิน ถ้าหลอดไฟเปิดไฟสีน้ำเงินอยู่จะเปิดไฟสีส้ม ถ้าหลอดไฟเปิดไฟสีส้มอยู่จะปิด
# หากมีหลอดไฟ ITLadkrabang ทั้งหมด n ดวง ที่ปิดอยู่ และมีการสับสวิตซ์ n ครั้ง ดังนี้
# ครั้งที่ 1 สับสวิตซ์ดวงที่หารด้วย 1 ลงตัว
# ครั้งที่ 2 สับสวิตซ์ดวงที่หารด้วย 2 ลงตัว
# …
# ครั้งที่ n สับสวิตซ์ดวงที่หารด้วย n ลงตัว

# ถ้าก่อนสับสวิตซ์หลอดไฟทุกดวงปิดอยู่ หลังสับสวิตซ์ครบ n ครั้ง จะมีหลอดไฟเปิดอยู่(ทุกสี)ทั้งหมดกี่ดวง
# รับข้อมูลเป็น : จำนวนหลอดไฟ n ดวง (จำนวนเต็มบวก)
# ส่งออกข้อมูลเป็น : จำนวนหลอดไฟที่เปิดอยู่หลังสับสวิตซ์ครบ n ครั้ง (จำนวนเต็มบวก)

led_stage = ["off", "blue", "orange"]
times = int(input())
for i in range(times):
    for j in range(times):
        led = times % times
        print(n)