# หากมีหลอดไฟ ITLadkrabang ทั้งหมด n ดวง ที่ปิดอยู่ และมีการสับสวิตซ์ n ครั้ง ดังนี้
# ครั้งที่ 1 สับสวิตซ์ดวงที่หารด้วย 1 ลงตัว
# …
# ครั้งที่ n สับสวิตซ์ดวงที่หารด้วย n ลงตัว

# ถ้าก่อนสับสวิตซ์หลอดไฟทุกดวงปิดอยู่ หลังสับสวิตซ์ครบ n ครั้ง จะมีหลอดไฟเปิดอยู่(ทุกสี)ทั้งหมดกี่ดวง
# รับข้อมูลเป็น : จำนวนหลอดไฟ n ดวง (จำนวนเต็มบวก)
# ส่งออกข้อมูลเป็น : จำนวนหลอดไฟที่เปิดอยู่หลังสับสวิตซ์ครบ n ครั้ง (จำนวนเต็มบวก)

led_stage = ["off", "blue", "orange"]
stage, save, times = 0, 0, int(input())
for i in range(1, times + 1):
    for j in range(1, times + 1):
        if i % j == 0:
            stage = (stage + 1) % 3
    if led_stage[stage] != "off":
        save += 1

print(save)
