# Lactasoy มีโปรโมชั่นใหม่อยู่คือ จากเดิมราคากล่องละ a บาท เมื่อนำหลอดมาแลกจำนวน b อันจะซื้อกล่องใหม่ได้ในราคา c บาท (โดยที่ c <= a) 
# หากต้องการ Lactasoy d กล่องจะต้องจ่ายเงินน้อยที่สุดเท่าไหร่
# Input Specification
# 4 บรรทัด :
# รับค่า a เป็นจำนวนเต็ม
# รับค่า b เป็นจำนวนเต็ม b = 0 หมายความว่าไม่สามารถนำหลอดมาลดราคาได้ ทุกกล่องต้องซื้อในราคา a
# รับค่า c เป็นจำนวนเต็ม
# รับค่า d เป็นจำนวนเต็ม
# Output Specification
# 1 บรรทัด :
# เป็นจำนวนเงินที่ซื้อในราคาที่น้อยที่สุด

normal_price = int(input())
straw_pro = int(input())
save_price = int(input())
want_lactasoy = int(input())
