# Description
# ลำดับ Fibonacci เป็นลำดับเลขชนิดพิเศษที่ไม่เหมือนกับลำดับเลขคณิต หรือเรขาคณิตทั่วไป

# โดยที่ลำดับ Fibonacci จะมีการนิยามสองลำดับแรกดังนี้ F(0) = 0 ; ลำดับที่ 0 F(1) = 1 ; ลำดับที่ 1 นอกเหนือจากลำดับดังกล่าว จะถูกสร้างขึ้นมาจากผมรวมของลำดับสองตัวก่อนหน้า F(N) = F(N-1) + F(N-2)

# ลำดับ Fibonacci จะมีการเรียงที่ตายตัวดังนี้ 0, 1, 1, 2, 3, 5, 8, 13, ...

# งานของคุณคือ ให้หาลำดับ Fibonacci ลำดับที่ N\

# ให้ใช้ Recursion

# Input Specification
# หนึ่งบรรทัด N

# Output Specification
# หนึ่งบรรทัด เป็นลำดับ Fibonacci ลำดับที่ N

# 10/30 ของ Testcases จะทำงานภายใน 1 วินาทีหากใช้ Recursion stack ธรรมดา
# 20/30 ของ Testcases จะทำงานภายใน 1 วินาทีหากใช้ Recursion + Memorization
# 21/30 ของ Testcases จะทำงานภายใน 1 วินาทีหากใช้ Recursion + Memorization + Recursive Optimization อีกนิดหน่อย
# 30/30 ของ Testcases จะทำงานภายใน 1 วินาทีหากทำการปรับปรุงการใช้งาน Recursion เพิ่มเติม

# 10    55
# 14    377