# มีเพื่อนคนหนึ่งของพี่เขาชอบเล่นเกม “Valorant” บนคอมพิวเตอร์ เขาตายบ่อยมากและเขาโทษว่า “เมาส์เร็วไปหรือช้าไปเสมอ”
# เราจึงอยากช่วยเขาโดยการเขียน Python เพื่อช่วยเขาหา Sensitivity ที่เขาถนัด
# โดยที่เราจะให้ผู้ใช้บอกว่า Sensitivity ที่ Generate ออกมานั้นช้าไปหรือเร็วไป เช่น เริ่มต้นโปรแกรมจะถามว่า ความเร็วเมาส์ 100 เร็วไปหรือช้าไป
# แล้วขึ้นอยู่กับคำตอบจากผู้ใช้โปรแกรมจะ Generate Sensitivity ออกมาใหม่ ถ้า 100 เร็วไปแล้ว 50 หล่ะ ช้าไปหรือเร็วไป ช้าไปหรอ 75 หล่ะ ช้าไปหรือเร็วไป
# จะถามไปเรื่อย ๆ และเข้าใกล้ Sensitivity ที่ถนัดเรื่อย ๆ จนเขาหา Sensitivity ของเขาเจอในที่สุด

# **วิธีการทำโจทย์**
# ในที่นี้เราจะเริ่มจาก 100 เราจะหา Maximum และ Minimum จากการตอบแต่ละครั้ง เช่น ถ้า 100 เร็วไป Sensitivity ที่ Generate ออกมาใหม่ต้องไม่มากกว่า 100
# เราก็จะรู้แล้วว่า Sensitivity ต้องอยู่ระหว่าง 0 และ 100 แน่ๆ ตัวต่อไปเราก็อาจถาม Mean ระหว่าง Minimum และ Maximum
# ในตัวอย่างนี้คือ 50 และหลังจากที่ผู้ใช้บอกว่าช้าไปหรือเร็วไป เราจะเอา 50 ไปแทนใน Minimum หรือ Maximum ถ้า 50 ช้าไป แสดงว่า Sensitivity
# มันต้องอยู่ระหว่าง 50 และ 100 หาไปเรื่อยๆใน while loop ก็ได้นะ แล้วถ้า 100 ช้าไปหล่ะ เราก็สามารถให้ Minimum เป็น 100 แต่ Maximum ยังไม่รู้ เราจะถาม
# โดยการนำตัวเดิม มาคูณ 2 แล้วถามใหม่ 200 หล่ะ ถ้า 200 ช้าไป Minimum เป็น 200 แล้วถาม 400 ถามไปเรื่อยๆจนกว่าเราจะได้ค่า Maximum
# แล้วเราก็สามารถามค่ากลางเหมือนเดิมได้ เร็วกว่า 200 ช้าไป 400 เร็วไป 300 หล่ะ ช้าไปหรือเร็วไป เป็นต้น และถ้า Input เป็น D ให้print() ค่า sensitivity ล่าสุด.

# Input Specification
# n บรรทัด
# บรรทัดที่ 1 ถึง n - 1 “S” หรือ “F” [โดยที่ “F” สื่อถึง Too (F)ast และ “S” สื่อถึง Too (S)low]
# บรรทัดที่ n “D” จบการทำงาน

# Output Specification
# n + 1 บรรทัด
# บรรทัดที่ 1 "100.00?"
# บรรทัดที่ 2 ถึง n
# แสดงผลค่า Sensitivity ที่ Generate ออกมาต้องเป็นจำนวนจริงที่มีทศนิยม 2 ตำแหน่งและเติม "?" ตามท้าย ในรูปแบบ "[ค่า Sensitivity]?"
# บรรทัดที่ n + 1
# "Your sensitivity is sensitivity [ค่า Sensitivity ล่าสุด]."