# ให้น้องๆรับค่าตัวเลขจำนวนเต็มบวกเข้ามาเรื่อยๆ จนกว่าจะเจอคำว่า "END"
# จากนั้นก็ให้หาเลขฐานสองของแต่ละ จำนวนที่รับเข้ามาบวกด้วยความถี่ของจำนวนนั้น
# เช่น INPUT คือ
# 2
# 2
# 2
# OUTPUT ก็คือ 101 ซึ่งเกิดจากการนำ 2 มาบวกกับความถี่ของ 2 ก็คือ 3 (เพราะว่ามี 2 อยู่ 3 ตัว) บวกกันได้ 5 จากนั้นจึงนำไปแปลงเป็นเลขฐาน 2

# Input Specification
# หลายบรรทัด เป็นเลขจำนวนเต็มมีค่ามากกว่า 0 หยุดรับค่าเมื่อเจอคำว่า END

# Output Specification
# จำนวนบรรทัดขึ้นอยู่กับ Input ประกอบด้วย ตัวเลขจำนวนเต็มและเลขฐานสองตามเงื่อนไขของโจทย์ข้างต้น คั่นด้วย "-->" โดยให้เรียงจากเลขจำนวนเต็มที่น้อยที่สุด

# 2
# 2
# 2
# END
# 2-->101

my_list = []

while True:
    text = input()
    if text.lower() != "end":
        found = False
        for item in my_list:
            if item[0] == text:
                item[1] += 1
                found = True
                break
        if not found:
            my_list.append([text, 1])
    else:
        break

for i in my_list :
    num = int(i[0]) + i[1]
    binary = "{0:b}".format(num)
    print(f'{i[0]}-->{binary}')