# วันนี้เราจะมาเจาะระบบเว็บ ijudge กันโดยที่ ijudge มีระดับการป้องกันถึง 25 ชั้น
# โดยเราจะ Hack ijudge กันด้วยรหัสตัวอักษร
# ตัวอักษรแต่ละตัวจะเจาะได้จำนวนชั้นดังนี้
# a, f, k, p, u, z : 1 ชั้น
# b, g, l, q, v : 2 ชั้น
# c, h, m, r, w : 3 ชั้น
# d, i, n, s, x : 4 ชั้น
# e, j, o, t, y : 5 ชั้น
# เราจะกรอกรหัส 5 ตัวน้องๆต้องตรวจว่าเจาะสำเร็จหรือไม่
# ถ้าสำเร็จตอบ"Unlock" ถ้าไม่บอกพี่หน่อยว่าเหลือกี่ชั้น

# Input Specification
# 5 บรรทัด:
# รหัสตัวที่ 1
# รหัสตัวที่ 2
# รหัสตัวที่ 3
# รหัสตัวที่4
# รหัสตัวที่ 5

# Output Specification
# 1 บรรทัด:
# Unlock ถ้าเจาะสำเร็จ
# จำนวนชั้นที่เหลือหากเจาะไม่สำเร็จ

# a         c
# b         h
# c         a
# d         f
# e         k
# Unlock    7