# ในโลกยุคกลางของเหล่าจอมเวทย์ดูเหมือนว่าจะมีจอมเวทย์แห่งกาลเวลาคนหนึ่ง(พี่เองแหละ อิอิ)
# ร่ายเวทย์มนต์แปลกๆทำให้ระบบเวลาของโลกแห่งนี้เปลี่ยนไป ซึ่งผลของมันก็คือ
# ทำให้เดือนที่ลงท้ายด้วยคำว่า 'คม' (EX: มกราคม,มีนาคม) มี 30 วัน
# ทำให้เดือนที่ลงท้ายด้วยคำว่า 'ยน' (EX: เมษายน,มิถุนายน) มี 31 วัน
# เดือนกุมภาพันธ์ มี 14 วัน
# จำนวนเดือนยังมี 12 เดือนเท่าเดิม
# เพราะเวทย์มนต์แปลกประหลาดนี้ทำให้เหล่าผู้คนสับสนกับวันเวลาเป็นอย่างมาก
# งานของน้อง คือ ให้เขียนโปรแกรมที่ช่วยบอกให้พี่ทราบว่า วันที่ x เดือน y นั้นคือวันอะไร
# เช่น วันที่ 5 เดือน 3 ก็คือ วันที่ 3 มีนาคม วันที่ 11 เดือน 11 ก็คือ วันที่ 11 พฤศจิกายน
# โดยที่น้องทราบมาเพียงว่าวันที่ 5 มกราคม คือ วันจันทร์
# หากวันหรือเดือนที่รับเข้ามาไม่อยู่ในเงื่อนไขข้างต้น ตัวอย่างเช่น วันที่ 32 เดือน 1
# ให้ตอบว่า Invalid Time

# Input Specification
# 2 บรรทัด
# x เป็นจำนวนเต็มบวก
# y เป็นจำนวนเต็มบวก

# Output Specification
# Monday เมื่อ วันที่ x เดือน y เป็นวันจันทร์
# Tuesday เมื่อ วันที่ x เดือน y เป็นวันอังคาร
# Wednesday เมื่อ วันที่ x เดือน y เป็นวันพุธ
# Thursday เมื่อ วันที่ x เดือน y เป็นวันพฤหัสบดี
# Friday เมื่อ วันที่ x เดือน y เป็นวันศุกร์
# Saturday เมื่อ วันที่ x เดือน y เป็นวันเสาร์
# Sunday เมื่อ วันที่ x เดือน y เป็นวันอาทิตย์
# Invalid Time เมื่อวันที่ x เดือน y ไม่อยู่ในเงื่อนไข