# Description
# แย่ละน้องๆพี่เหลือกระสุนอยู่ Mag สุดท้ายละพี่ต้องยิงมันให้ตาย
# โดยพี่จะบอกจำนวนกระสุนของพี่
# พลังชีวิตที่เหลือของศัตรู
# และดาเมจของปืนพี่
# แต่เพราะพี่ยิงแม่นมากน้องช่วยบอกพี่หน่อยว่าศัตรูจะตายรึป่าว

# Input Specification
# 3 บรรทัด :
# กระสุนของพี่(จำนวนเต็ม)
# พลังชีวิตที่เหลือของศัตรู(จำนวนจริง)
# ดาเมจของปืน(จำนวนจริง)

# Output Specification
# 1 บรรทัด :
# ถ้าศัตรูรอดแสดง alive : พลังชีวิตที่ยังเหลืออยู่ของศัตรู(จำนวนจริง) health
# ถ้าศัตรูตายแสดง dead : กระสุนที่เหลืออยู่(จำนวนเต็ม) bullet remain