def main():
    hp_dedee = float(input())
    adapt_dedee = float(input())
    count_attack = int(input())
    for i in count_attack:
        print("STH")
main()

# ดีดี้เป็นนักใช้คุณไสยที่แข็งแกร่งที่สุดในประวัติศาสตร์คณะเทคโนโลยีสารสนเทศแล้วตอนนี้เขากำลังสู้อยู่กับ
# พาลอยซึ่งพาลอยมีวิชาไร้ขีดจำกัดล่างโดยความสามารถของพาลอยสามารถป้องกันการโจมตีได้ทุกรูปแบบ
# โดยดีดี้มีพลังชีวิต N หน่วย และดีดี้ก็มีวิชาในการปรับตัว กล่าวคือ เมื่อดีดี้โดนโจมตีจนถึงในจุดที่กำหนดดีดี้จะ
# สามารถโจมตีใส่ผู้ที่โจมตีดีดี้ได้แบบ 100%

# อธิบายการเก็บค่าการปรับตัว โดยดีดี้จะรับการโจมตีและนำไปเป็นค่าการปรับตัว โดยเมื่อดีดี้ได้รับการโจมตีจะ
# นำความเสียหายที่ได้รับจำนวน 0.03 เท่าของค่าแดมเมจที่ได้รับ นำไปเป็นค่าการปรับตัว กล่าวคือเมื่อค่าปรับตัวครบ n หน่วย 
# ดีดี้จะสามารถโจมตีพาลอยได้ โดยถ้าดีดี้ยังมีพลังชีวิตเหลือจะสามารถโจมตีพาลอยได้(พาลอยจะซาชิมิทันที) แต่ถ้าดีดี้ Hp หมด ดีดี้จะกลายเป็นโดนัท 
# โดยพาลอยจะต้องโจมตีจนครบทุกครั้งก่อนดีดี้จึงจะมีโอกาสโจมตีสวน(ถ้าดีดี้ยังไม่โดนัทละก็นะ)

# อธิบายผลลัพธ์ง่ายๆนะ
# ถ้าดีดี้ HP หมด = ดีดี้โดนัท

# ถ้า HP ดีดี้เหลือและค่าปรับตัวมากกว่าหรือเท่าที่กำหนด = พาลอยซาชิมิ
# เมื่อดีดี้พลังชีวิตเหลือและค่าปรับตัวน้อยกว่าที่กำหนด = ตายคู่
# พาลอยนักใช้คุณไสย

# Input Specification
# บรรทัด 1 เลือดของดีดี้(float)
# บรรทัด 2 ค่าการปรับตัวที่ต้องครบ(float)
# บรรทัด 3 จำนวนการโจมตีของพาลอย(int)
# บรรทัด n+1 แดมเมจที่พาลอยโจมทีในแต่ละที (float)

# Output Specification
# ดีดี้โดนัท (ถ้าดีดี้ HP หมด)
# พาลอยซาชิมิ(ถ้า HP ดีดี้เหลือและค่าปรับตัวมากกว่าหรือเท่ากับที่กำหนด)
# ตายคู่(เมื่อดีดี้พลังชีวิตเหลือและค่าปรับตัวน้อยกว่าที่กำหนด)
