# ร้าน Fastfood แห่งหนึ่งขาย Hamburger ราคา a บาท เมื่อซื้อครบ b ชิ้น จะได้ฟรี c ชิ้น
# ซึ่งพี่อยากกินทั้งหมด d ชิ้น พี่ต้องจ่ายเงินน้อยที่สุดกี่บาทถึงจะได้กินเบอร์เกอร์เพียงพอกับที่พี่อยากกิน(เกินได้แต่ห้ามขาด)

# Input Specification
# 4 บรรทัด ทุกบรรทัดเป็นจำนวนเต็มบวกที่มีค่ามากกว่าหรือเท่ากับ 0
    # บรรทัดแรก : ค่าของ a
    # บรรทัดที่สอง : ค่าของ b
    # บรรทัดที่สาม : ค่าของ c
    # บรรทัดที่สี่ : ค่าของ d
# Output Specification
# 2 บรรทัด
    # บรรทัดที่ 1 : จำนวน Hamburger ที่ได้รับ (ชิ้น)
    # บรรทัดที่ 2 : จำนวนเงินน้อยที่สุดที่เราต้องจ่าย (บาท)

'''Hello <i>Judge'''

def main():
    '''Main Function'''
    # Write your code here

main()
