# One-time Password (OTP)
# คือรหัสผ่านที่สามารถใช้ได้เพียงครั้งเดียวเท่านั้น และจะไม่สามารถใช้ได้อีก
# มีไว้เพื่อยืนยันตัวตน ใช้ร่วมกับอุปกรณ์อื่น เช่นโทรศัพท์มือถือ หรือ E-Mail
# ตัวอย่างเช่น ผู้ใช้บริการจะทำการโอนเงินออกจากบัญชีผ่านธุรกรรมออนไลน์
# ตัวระบบนั้นจะส่ง OTP มายังมือถือของผู้ใช้บริการ เพื่อเป็นเครื่องยืนยันว่า ผู้ที่ทำการโอนเงินนั้น คือผู้ใช้บริการจริงๆ
# ก็คือเจ้าของโทรศัพท์มือถือ ที่สามารถใช้งานมือถือได้(มีรหัสปลดล็อคเครื่อง ฯลฯ) เพื่ออ่าน SMS ที่มี OTP อยู่
# แล้วจึงระบุ OTP ให้ระบบโอนเงินทราบ จึงสามารถทำการโอนเงินได้
# อะไรประมาณนี้
# ซึ่งโดยทั่วไปนั้น OTP จะเป็นตัวเลขที่สามารถจดจำได้ง่าย มีตัวเลขซ้ำๆกันอยู่ เช่น 2287, 5848, 9910 เป็นต้น
# ซึ่งคุณ โปรแกรมเมอร์ที่มีชื่อเสียง(อีกแล้ว) ได้รับการจ้างให้ทำการตรวจสอบ OTP ของระบบหนึ่ง
# ว่ามีคุณสมบัติตรงตามที่นิยามเอาไว้หรือไม่
# โดยที่นิยามคือ
# OTP ที่มี 4 หลัก จะต้องมีเลขซ้ำกัน 1 ตัว, 2 หลักเท่านั้น (1120, 0850, 4543)
# OTP ที่มี 6 หลัก จะต้องมีเลขซ้ำกัน 2 ตัว, 4 หลัก หรือ 1 ตัว 3 หลัก อีกสามหลักจะเป็นอะไรก็ได้ (151567, 997882, 321324, 115167, 987666)
# OTP ที่มี 8 หลัก จะต้องมีเลขซ้ำกัน 3 ตัว, 6 หลัก หรือ 2 ตัว 6 หลัก อีกสองหลักจะเป็นอะไรก็ได้ (11223345, 68682400, 84886044)
# โปรแกรมของคุณจะต้องรับ OTP มาเรื่อยๆ จนกว่าจะได้รับเลข 0 เข้ามา คือให้หยุดการรับข้อมูล
# Input Specification
# หลายบรรทัด + 1
# ในแต่ละหลายบรรทัด: OTP ที่มี 4, 6, หรือ 8 หลัก; เป็นตัวเลขทั้งหมด
# บรรทัดสุดท้ายคือเลข 0 เป็นตัวบอกว่าไม่มีค่ารับเข้าอีกแล้ว
# Output Specification
# หลายบรรทัด
# ในแต่ละหลายบรรทัด ให้แสดงผลว่า Valid หาก OTP ถูกต้องตามเงื่อนไข ตามลำดับที่ได้รับเข้ามา หรือ Invalid หากไม่ถูกต้อง

# 6498    Invalid
# 7763    Valid
# 2626    Invalid
# 5479    Invalid
# 1939    Valid
# 0717    Valid
# 0